# Modelo Orientado a objetos

## Elaborar un esquema conceptual para convertir este código a un modelo orientado a objetos.

In [141]:
import pandas as pd
import pymysql

## Clase

In [159]:
class ConnectDB():
    """
    Clase usada para la Conexión de la Base de Datos mySQL 
    """

    def __init__(self, host, user, password, db):
        self.host = host
        self.user = user
        self.password = password
        self.db = db
        cursor = ''
        self.successfullConnection()

    def successfullConnection(self):
        """
        Conexión a la BBDD de Employees
        """
        try:
            self.bbdd = pymysql.connect(
                host=self.host, user=self.user, password=self.password, db=self.db)
            self.cursor = self.bbdd.cursor()
            return("Conexión Correcta")
        except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
            return("Ocurrió un error al conectar: ", e)

    def connection(self):
        """
        Comprobando conexión
        """
        if hasattr(self, 'bbdd'):
            return self.cursor
        else:
            return self.successfullConnection()

    def get(self, cons):
        """
        Obtener todas la/s fila/s de la consulta
        """
        if self.connection():
            execute = self.cursor.execute(cons)
            if execute > 1:
                return self.cursor.fetchall()
            return self.cursor.fetchone()

    def put(self, cons, values):
        """
        Insertar o Eliminar una consulta
        """
        if self.connection():
            execute = self.cursor.execute(cons, values)
        self.bbdd.commit()

    def dFrame(self, cons):
        """
        Generar el datafrae
        """
        if self.successfullConnection():
            df = pd.read_sql_query(cons, self.bbdd)
            return df.head(10)

# Objeto de la clase

In [143]:
cDB = ConnectDB('localhost', 'root', 'root', 'employees')

---

## Obtenemos los datos de la tabla employees

In [144]:
cons = "SELECT * FROM employees;"
employees = cDB.dFrame(cons)
print(employees)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

---

## Obtener los datos completos de los departamentos

In [170]:
cons = "SELECT * FROM departments;"
departments = cDB.dFrame(cons)
print(departments)

  dept_no           dept_name
0    d010    Ciencia de Datos
1    d009    Customer Service
2    d005         Development
3    d002             Finance
4    d003     Human Resources
5    d011    Machine Learning
6    d001           Marketing
7    d004          Production
8    d006  Quality Management
9    d008            Research

---

## Obtenemos los datos de la tabla employees que sean mujeres

In [146]:
cons = "SELECT * FROM employees WHERE gender ='F';"
emp_F = cDB.dFrame(cons)
print(emp_F)

   emp_no  birth_date first_name   last_name gender   hire_date
0   10002  1964-06-02    Bezalel      Simmel      F  1985-11-21
1   10006  1953-04-20     Anneke     Preusig      F  1989-06-02
2   10007  1957-05-23    Tzvetan   Zielinski      F  1989-02-10
3   10009  1952-04-19     Sumant        Peac      F  1985-02-18
4   10010  1963-06-01  Duangkaew    Piveteau      F  1989-08-24
5   10011  1953-11-07       Mary       Sluis      F  1990-01-22
6   10017  1958-07-06  Cristinel   Bouloucos      F  1993-08-03
7   10018  1954-06-19   Kazuhide        Peha      F  1987-04-03
8   10023  1953-09-29      Bojan  Montemayor      F  1989-12-17
9   10024  1958-09-05    Suzette      Pettey      F  1997-05-19

---

## Obtener la cantidad de empleados de sexo femenino.

In [147]:
cons = "SELECT COUNT(*) AS Mujeres FROM employees WHERE gender ='F';"
cant_F = cDB.dFrame(cons)
print(cant_F)

   Mujeres
0   120051

---

## Obtener los empleados que son o han sido "Staff". Recordar que es una consulta multi tablas.

In [148]:
cons = "SELECT e.emp_no, birth_date, first_name, last_name, gender, hire_date, title FROM employees AS e JOIN titles AS t ON e.emp_no = t.emp_no WHERE t.title = 'Staff';"
staff = cDB.dFrame(cons)
print(staff)

   emp_no  birth_date first_name    last_name gender   hire_date  title
0   10002  1964-06-02    Bezalel       Simmel      F  1985-11-21  Staff
1   10005  1955-01-21    Kyoichi     Maliniak      M  1989-09-12  Staff
2   10007  1957-05-23    Tzvetan    Zielinski      F  1989-02-10  Staff
3   10011  1953-11-07       Mary        Sluis      F  1990-01-22  Staff
4   10016  1961-05-02   Kazuhito  Cappelletti      M  1995-01-27  Staff
5   10017  1958-07-06  Cristinel    Bouloucos      F  1993-08-03  Staff
6   10019  1953-01-23    Lillian      Haddadi      M  1999-04-30  Staff
7   10034  1962-12-29      Bader         Swan      M  1988-09-21  Staff
8   10038  1960-07-20       Huan        Lortz      M  1989-09-20  Staff
9   10039  1959-10-01  Alejandro      Brender      M  1988-01-19  Staff

---

## Agregar el departamento Ciencia de Datos

In [ ]:
cons = "INSERT INTO departments (dept_no, dept_name) VALUES (%s, %s);"
values = ('d010', 'Ciencia de Datos')
insert_cs = cDB.put(cons, values)

In [153]:
cons = "SELECT dept_no, dept_name FROM departments WHERE dept_name = 'Ciencia de Datos'; "
dpt_cd = cDB.dFrame(cons)
print(dpt_cd)

  dept_no         dept_name
0    d010  Ciencia de Datos

---

## Insertamos un valor en la tabla employees

In [172]:
cons = "INSERT INTO employees(emp_no, birth_date, first_name, last_name, gender, hire_date) VALUES (%s, %s, %s, %s, %s, %s);"
values = ('00006', '1985-05-01', 'Raul', 'Pe', 'M', '1985-01-01')
insert = cDB.put(cons, values)

In [173]:
cons = "SELECT emp_no, birth_date, first_name, last_name, gender, hire_date FROM employees WHERE emp_no = '00006';"
dpt_cd = cDB.dFrame(cons)
print(dpt_cd)

   emp_no  birth_date first_name last_name gender   hire_date
0       6  1985-05-01       Raul        Pe      M  1985-01-01

---

## Borrar el empleado "Raul"

In [176]:
cons = "DELETE FROM employees WHERE first_name = %s;"
values = 'Raul'
delete = cDB.put(cons, values)

In [177]:
cons = "SELECT emp_no, birth_date, first_name, last_name, gender, hire_date FROM employees WHERE emp_no = '00006';"
dpt_cd = cDB.dFrame(cons)
print(dpt_cd)

Empty DataFrame
Columns: [emp_no, birth_date, first_name, last_name, gender, hire_date]
Index: []